[Reward_RetrieveItem X2RewardTemplate]
DisplayName="Cache of the Fallen Hero"

[CovertAction_RetrieveBody X2CovertActionTemplate]
ActionObjective="Recover Remains of a Fallen Hero"

[CovertActionNarrative_RetrieveBody_Skirmishers X2CovertActionNarrativeTemplate]
ActionName="Recover Remains"
ActionPreNarrative="While we Skirmishers do not see the need for burials or any such thing, we still know that not all are like us, and desire to honour their dead in many different ways. We shall find <font color='#E52E11'><XGParam:StrValue4/!FallenSoldierName/></font>."
ActionPostNarrative="As promised we have found the fallen and returned them to you alongside a cache of their equipment."

[CovertActionNarrative_RetrieveBody_Reapers X2CovertActionNarrativeTemplate]
ActionName="Recover Remains"
ActionPreNarrative="My people honor our fallen heroes in a different way, but we understand the need to do this. Ready whenever you need us to find <font color='#E52E11'><XGParam:StrValue4/!FallenSoldierName/></font>."
ActionPostNarrative="We shall make the aliens pay ten fold for every one of us that falls in this war."

[CovertActionNarrative_RetrieveBody_Templars X2CovertActionNarrativeTemplate]
ActionName="Recover Remains"
ActionPreNarrative="Us Templars understand greatly the desire to honour the dead, we take great care to bring back our own when we can. Their Psionic energies can still be sensed even in death, the same goes to your own fallen. Just give the word and we will start our search to find <font color='#E52E11'><XGParam:StrValue4/!FallenSoldierName/></font>."
ActionPostNarrative="Their Sacrifice shall not be forgotten any time soon Commander, but at least they can be honoured in death now."